#pragma once

#include <fstream>
#include <iostream>

using namespace std;

string open_file(ifstream &file); // Відкриття файлу

void main_menu(); // Головне меню

// Завдання 1 - Array83
// Дан масив розміру N.
// Здійснити циклічний зсув елементів масиву вправо на одну позицію
// (при цьому A1 перейде в A2, A2 — в A3, ..., AN — в A1)
void task_1();

// Завдання 2 - Matrix35
// Дана матриця розміру M x N. Знайти номер першого з її рядків,
// що містить тільки непарні числа. Якщо таких рядків немає, то вивести 0
void task_2();

// Завдання 3 - Sort19
// Реалізувати бульбашкове сортування символьного масиву
// в порядку зростання
void task_3();
